#include <stdio.h>
#include <math.h>

float u2f(unsigned x)
{
    return *(float *)&x;
}

float fpwr2(int x)
{
    unsigned exp, frac;
    if (x < -126 + -23) {
        exp = 0;
        frac = 0;
    } else if (x < -126) {
        /* 非规格化值 */

        /*
         * 如果 x == -127，那么此时是 0 00000000 10000000000000000000000
         * 此时 1 左移了 22 位，即 23 - 1
         * 如果 x == -128，那么此时是 0 00000000 01000000000000000000000
         * 此时 1 左移了 21 位，即 23 - 2
         * 可以看出规律位 1 左移 -126 - x 位
         * ......
         */
        exp = 0;
        frac = 1 << (-126 - x); 
    } else if (x <= 127) {
        /* 规格化值 */
        /*
         * 如果此时 x 为 127，使浮点数编码为 0 11111110 00000000000000000000000
         * 那么阶码为 127，即 2^127 次方
         * 如果 x 为 128，溢出到正无穷大
         *
         * 如果 x == -126，阶码为 1, 浮点数编码为 0 00000001 00000000000000000000000
         * 如果 x == -125, 阶码为 2，浮点数编码为 0 00000010 00000000000000000000000
         * 如果 x == 0，   阶码为 127, 浮点数编码为 0 01111111 00000000000000000000000
         * 如果 x == 1,    浮点数编码为 0 10000000 00000000000000000000000 
         */
        exp = 127 + x;
        frac = 0; 
    } else {
        exp = (1 << 8) - 1;
        frac = 0;
    }
    unsigned y = (exp << 23) | frac;
    return u2f(y);
}

int main(int argc, char *argv[])
{
    for (int i = -150; i <= 150; i++) {
        printf("%.2f --- %.2f\n", powf(2, i), fpwr2(i));
    }
}

